src/Catalogs/КИИ_ПравилаИгнорированияОшибок/КИИ_ПравилаИгнорированияОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_ПравилаИгнорированияОшибок</name>
  <comment>Правила подавления ошибок мониторинга: совпавшая ошибка помечается Игнорировать на этапе сбора (не идёт ни в анализ, ни в телеграм).</comment>
  <attributes>
    <name>Событие</name>
    <comment>Совпадение по имени события (подстрока, пустое = любое)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <comment>Совпадение по метаданным (подстрока)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСодержит</name>
    <comment>Совпадение по подстроке текста ошибки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <comment>Правило включено</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КИИ_ПравилаИгнорированияОшибок/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПояснениеПравила = НСтр(
		"ru = 'Совпадают все заполненные условия. Подстроки учитывают регистр. Пустое правило не подавляет ошибки.
			|Одно короткое условие может скрыть слишком много ошибок. Проверка не сохраняет правило и ничего не
			|отправляет.'");

	ХешДляПроверки = "";
	Если Параметры.Свойство("ХешДляПроверки", ХешДляПроверки) И ЗначениеЗаполнено(ХешДляПроверки) Тогда
		ЗаписьОшибки = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьМенеджерЗаписи();
		ЗаписьОшибки.ХешОшибки = ХешДляПроверки;
		ЗаписьОшибки.Прочитать();
		Если ЗаписьОшибки.Выбран() Тогда
			ПробноеСобытие = ЗаписьОшибки.Событие;
			ПробныеМетаданные = ЗаписьОшибки.Метаданные;
			ПробныйТекст = ЗаписьОшибки.ТекстОшибки;
			Объект.Событие = ПробноеСобытие;
			Объект.Метаданные = ПробныеМетаданные;
			Объект.ТекстСодержит = Лев(ПробныйТекст, 120);
			Объект.Наименование = Лев(ПробныйТекст, 100);
			Объект.Активно = Ложь;
			ПроверитьПравилоНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ПустоеАктивноеПравило = ТекущийОбъект.Активно И ПустаяСтрока(ТекущийОбъект.Событие)
		И ПустаяСтрока(ТекущийОбъект.Метаданные) И ПустаяСтрока(ТекущийОбъект.ТекстСодержит);
	Если ПустоеАктивноеПравило Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для активного правила заполните хотя бы одно условие.'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПравило(Команда)

	ПроверитьПравилоНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПравилоНаСервере()

	Правило = Новый Структура;
	Правило.Вставить("Событие", Объект.Событие);
	Правило.Вставить("Метаданные", Объект.Метаданные);
	Правило.Вставить("ТекстСодержит", Объект.ТекстСодержит);
	Правило.Вставить("Активно", Объект.Активно);
	Ошибка = Новый Структура("Событие, Метаданные, Текст", ПробноеСобытие, ПробныеМетаданные, ПробныйТекст);
	Проверка = КИИ_МониторингОшибокРегистры.РезультатПроверкиПравила(Правило, Ошибка);
	РезультатПроверкиПравила = Проверка.Пояснение;

КонецПроцедуры

#КонецОбласти
